# Part 1 - Truecar.com - New York

#### Step 1 - Imports

In [2]:
import requests
import pandas as pd 
from sqlalchemy import create_engine

#### Step 2 - Python Request

In [2]:
headers = {
    'authority': 'www.truecar.com',
    'sec-ch-ua': '^\\^Chromium^\\^;v=^\\^92^\\^, ^\\^',
    'accept': 'application/json, text/plain, */*',
    'x-xsrf-token': 'Ur/kxt0PrKLpIlS3QELPXZBZHMSME0gTzs47TPfIUiC1LJqIt9HlLYrLTMgwB5qE6zC2M5Psn5Er+4Qm82MgEA==',
    'sec-ch-ua-mobile': '?0',
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.131 Safari/537.36',
    'sec-fetch-site': 'same-origin',
    'sec-fetch-mode': 'cors',
    'sec-fetch-dest': 'empty',
    'referer': 'https://www.truecar.com/used-cars-for-sale/listings/location-new-york-ny/',
    'accept-language': 'en-US,en;q=0.9,de-DE;q=0.8,de;q=0.7',
    'cookie': 'tc_v=732d8f6c-016d-4e04-99ea-962821b285bd; u=rBEABWDn9kVuLQARuYhKAg==; user_zip_code_san-francisco-ca=94102; user_zip_code_new-york-ny=10001; _abp_auth_p=eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIwN2Q0MTBkOS0zYjYwLTQwNTAtYjhiMy0yN2VhNzI5YjI4MmEiLCJpYXQiOjE2MjgwNTk1ODAsImV4cCI6MTY0NDA1OTU4MCwianRpIjoiMTkxNjdlZmYtNDg5NC00NWE5LTgwMzItYjNjNWYyNjJhZjg3IiwiYXV0aGVudGljYXRlZCI6ZmFsc2UsInByZXNldCI6eyJhZmZpbGlhdGlvbnMiOltdfSwiYXVkIjoiaHR0cHM6Ly93d3cudHJ1ZWNhci5jb20ifQ; _abp_auth_s=aLdzR1stp7FxiV6Cbnggg8fmtny6X9FAap2fnCqWeXg; referrer=ZTC0000000; g_state=^{^\\^i_p^\\^:1628151776913,^\\^i_l^\\^:2^}; capselaPreferredPostalCode=10001; XSRF-TOKEN=Ur^%^2Fkxt0PrKLpIlS3QELPXZBZHMSME0gTzs47TPfIUiC1LJqIt9HlLYrLTMgwB5qE6zC2M5Psn5Er^%^2B4Qm82MgEA^%^3D^%^3D; _abp_backend_session=cnN3bFdMQjJQYTlwRFFvS3oybm1oWTl0SVc3NVNGRng5Y01GWHlxa3BybWFJRXM1UkFueTFRWUhMYUtSVW1YZWxNaUFIZ2ZjS2FUQ2pVeURRNG5PeEh6VlRFQjZnRmFLN01PWHZFdjBQTis5UG9VRGFtWko4MFZNY2ZUUGRmS1pkSFdmcnB4TVkwMnJGREZBblZla1RRPT0tLW5BQjFPdHVvTk1VbHJZL3lwQ2MrTUE9PQ^%^3D^%^3D--a4caf99167368bcbbcd454b4ffe52eb35169abe0; _dd_s=rum=0&expire=1628067151364',
    'if-none-match': 'W/^\\^ad5f12263df3f1f7dad67afa854d2880^\\^',
}

params = (
    ('city', 'new-york'),
    ('collapse', 'true'),
    ('fallback', 'true'),
    ('include_incentives', 'true'),
    ('include_targeted_incentives', 'true'),
    ('new_or_used', 'u'),
    ('page', '1'),
    ('per_page', '30'),
    ('postal_code', '10001'),
    ('search_event', 'true'),
    ('sort^/[^/]', 'best_match'),
    ('sponsored', 'true'),
    ('state', 'ny'),
)

response = requests.get('https://www.truecar.com/abp/api/vehicles/used/listings', headers=headers, params=params)

#NB. Original query string below. It seems impossible to parse and
#reproduce query strings 100% accurately so the one below is given
#in case the reproduced version is not "correct".
# response = requests.get('https://www.truecar.com/abp/api/vehicles/used/listings?city=new-york&collapse=true&fallback=true&include_incentives=true&include_targeted_incentives=true&new_or_used=u&page=2&per_page=30&postal_code=10001&search_event=true&sort^\[^\]=best_match&sponsored=true&state=ny', headers=headers)

#### Step 3 - Check Status Code

In [3]:
response

#### Step 4 - Create Json Object

In [5]:
results_json = response.json()

In [6]:
type(results_json)

dict

#### Step 5 - Output Keys

In [7]:
results_json.keys()

dict_keys(['listings', 'page', 'per_page', 'total', 'fallback', 'fallback_step', 'refine_parameters', 'display', 'list_price', 'sponsored_listings', 'location'])

#### Step 6 - Find your Data

Necessary data
- brand
- model
- mileage
- year
- price

In [9]:
len(results_json['listings'])

30

In [10]:
result_items = results_json['listings']

In [26]:
len(result_items)

30

In [13]:
# brand 
result_items[0]['vehicle']['make']

'Mercedes-Benz'

In [16]:
# model 
result_items[0]['vehicle']['model']

'C-Class'

In [19]:
# mileage
result_items[0]['vehicle']['mileage']

29641

In [22]:
# year
result_items[0]['vehicle']['year']

2018

In [25]:
# price
result_items[0]['pricing']['list_price']

29901

#### Step 7 - Put everything together & For-Loop

In [31]:
brand_ny = []
model_ny = []
mileage_ny = []
year_ny = []
price_ny = []

for result in result_items:
    
    # brand
    brand_ny.append(result['vehicle']['make'])
    
    # model
    model_ny.append(result['vehicle']['model'])
    
    # mileage
    mileage_ny.append(result['vehicle']['mileage'])
    
    # year
    year_ny.append(result['vehicle']['year'])
    
    # price
    price_ny.append(result['pricing']['list_price'])

#### Step 8 - Pandas Dataframe - Single Page

In [32]:
df_ny_single = pd.DataFrame({'Brand': brand_ny, 'Model': model_ny, 'Mileage': mileage_ny, 'Year': year_ny,
                             'Price':price_ny})

In [33]:
df_ny_single

            Brand           Model  Mileage  Year   Price
0   Mercedes-Benz         C-Class    29641  2018   29901
1   Mercedes-Benz         C-Class    13015  2018   31902
2           Lexus              RX    39908  2017   30461
3   Mercedes-Benz         C-Class     9469  2018   32901
4   Mercedes-Benz             GLE    43595  2018   38901
5            Jeep  Grand Cherokee    26553  2018   30784
6   Mercedes-Benz         C-Class    34843  2018   30901
7   Mercedes-Benz         C-Class    17880  2018   32901
8          Toyota            RAV4    43028  2017   20295
9           Lexus              ES    29288  2018   28526
10    Rolls-Royce         Phantom    27267  2009  169995
11          Lexus              RX    25063  2018   37350
12          Lexus              ES    29726  2018   28610
13  Mercedes-Benz             GLE    29557  2018   40901
14          Lexus              ES    10414  2018   29471
15  Mercedes-Benz         C-Class    13363  2018   32901
16      Chevrolet          Malibu    51681  2020   18697
17          Lexus              ES    11522  2018   28933
18           Jeep         Compass    25623  2018   17995
19  Mercedes-Benz             GLC    26378  2019   36901
20  Mercedes-Benz             GLE    44508  2018   38901
21          Lexus              ES    54824  2014   18995
22          Lexus              RX    22868  2017   34596
23         Nissan           Rogue    23530  2018   18193
24          Lexus              RX    24647  2018   37726
25           Ford        EcoSport   131326  2018    9495
26  Mercedes-Benz             CLA    38934  2018   27901
27          Lexus              RX    28817  2018   37302
28          Lexus              RX    22919  2018   36549
29         Nissan           Rogue    30217  2018   15995

#### Step 9 - Scraping Multiple Pages (here: ~5000results)

In [2]:
brand_ny = []
model_ny = []
mileage_ny = []
year_ny = []
price_ny = []

for i in range(1,170):

    headers = {
        'authority': 'www.truecar.com',
        'sec-ch-ua': '^\\^Chromium^\\^;v=^\\^92^\\^, ^\\^',
        'accept': 'application/json, text/plain, */*',
        'x-xsrf-token': 'Ur/kxt0PrKLpIlS3QELPXZBZHMSME0gTzs47TPfIUiC1LJqIt9HlLYrLTMgwB5qE6zC2M5Psn5Er+4Qm82MgEA==',
        'sec-ch-ua-mobile': '?0',
        'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.131 Safari/537.36',
        'sec-fetch-site': 'same-origin',
        'sec-fetch-mode': 'cors',
        'sec-fetch-dest': 'empty',
        'referer': 'https://www.truecar.com/used-cars-for-sale/listings/location-new-york-ny/',
        'accept-language': 'en-US,en;q=0.9,de-DE;q=0.8,de;q=0.7',
        'cookie': 'tc_v=732d8f6c-016d-4e04-99ea-962821b285bd; u=rBEABWDn9kVuLQARuYhKAg==; user_zip_code_san-francisco-ca=94102; user_zip_code_new-york-ny=10001; _abp_auth_p=eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIwN2Q0MTBkOS0zYjYwLTQwNTAtYjhiMy0yN2VhNzI5YjI4MmEiLCJpYXQiOjE2MjgwNTk1ODAsImV4cCI6MTY0NDA1OTU4MCwianRpIjoiMTkxNjdlZmYtNDg5NC00NWE5LTgwMzItYjNjNWYyNjJhZjg3IiwiYXV0aGVudGljYXRlZCI6ZmFsc2UsInByZXNldCI6eyJhZmZpbGlhdGlvbnMiOltdfSwiYXVkIjoiaHR0cHM6Ly93d3cudHJ1ZWNhci5jb20ifQ; _abp_auth_s=aLdzR1stp7FxiV6Cbnggg8fmtny6X9FAap2fnCqWeXg; referrer=ZTC0000000; g_state=^{^\\^i_p^\\^:1628151776913,^\\^i_l^\\^:2^}; capselaPreferredPostalCode=10001; XSRF-TOKEN=Ur^%^2Fkxt0PrKLpIlS3QELPXZBZHMSME0gTzs47TPfIUiC1LJqIt9HlLYrLTMgwB5qE6zC2M5Psn5Er^%^2B4Qm82MgEA^%^3D^%^3D; _abp_backend_session=cnN3bFdMQjJQYTlwRFFvS3oybm1oWTl0SVc3NVNGRng5Y01GWHlxa3BybWFJRXM1UkFueTFRWUhMYUtSVW1YZWxNaUFIZ2ZjS2FUQ2pVeURRNG5PeEh6VlRFQjZnRmFLN01PWHZFdjBQTis5UG9VRGFtWko4MFZNY2ZUUGRmS1pkSFdmcnB4TVkwMnJGREZBblZla1RRPT0tLW5BQjFPdHVvTk1VbHJZL3lwQ2MrTUE9PQ^%^3D^%^3D--a4caf99167368bcbbcd454b4ffe52eb35169abe0; _dd_s=rum=0&expire=1628067151364',
        'if-none-match': 'W/^\\^ad5f12263df3f1f7dad67afa854d2880^\\^',
    }

    params = (
        ('city', 'new-york'),
        ('collapse', 'true'),
        ('fallback', 'true'),
        ('include_incentives', 'true'),
        ('include_targeted_incentives', 'true'),
        ('new_or_used', 'u'),
        ('page', str(i)),
        ('per_page', '30'),
        ('postal_code', '10001'),
        ('search_event', 'true'),
        ('sort^/[^/]', 'best_match'),
        ('sponsored', 'true'),
        ('state', 'ny'),
    )

    # response
    response = requests.get('https://www.truecar.com/abp/api/vehicles/used/listings', headers=headers, params=params)

    # json object
    results_json = response.json()
    
    # result items (30 items per page)
    result_items = results_json['listings']
    
    for result in result_items:
    
        # brand
        brand_ny.append(result['vehicle']['make'])

        # model
        model_ny.append(result['vehicle']['model'])

        # mileage
        mileage_ny.append(result['vehicle']['mileage'])

        # year
        year_ny.append(result['vehicle']['year'])

        # price
        price_ny.append(result['pricing']['list_price'])

In [3]:
df_ny_single = pd.DataFrame({'Brand': brand_ny, 'Model': model_ny, 'Mileage': mileage_ny, 'Year': year_ny,
                             'Price':price_ny})

In [4]:
df_ny_single

              Brand           Model  Mileage  Year    Price
0     Mercedes-Benz         C-Class    29641  2018  29901.0
1             Lexus              RX    39908  2017  30171.0
2     Mercedes-Benz         C-Class    13015  2018  31902.0
3             Lexus              ES    29288  2018  28224.0
4     Mercedes-Benz         C-Class     9469  2018  32901.0
...             ...             ...      ...   ...      ...
5065      Chevrolet  Malibu Limited    65339  2016  11999.0
5066          Mazda          Mazda3    19605  2018  16217.0
5067  Mercedes-Benz             GLC     8263  2021  46996.0
5068      Chevrolet        Traverse    25537  2019  32990.0
5069           Jeep  Grand Cherokee    24888  2018  28995.0

[5070 rows x 5 columns]

In [37]:
df_ny_single.to_excel('output_5k.xlsx', index=False)

# Part 2 - Truecar.com - San Francisco

In [5]:
brand_sf = []
model_sf = []
mileage_sf = []
year_sf = []
price_sf = []

for i in range(1,170):
    headers = {
        'authority': 'www.truecar.com',
        'sec-ch-ua': '^\\^Chromium^\\^;v=^\\^92^\\^, ^\\^',
        'accept': 'application/json, text/plain, */*',
        'x-xsrf-token': 'sRHovNRE9jEGmReSnaj0SFGY/L5+yUbMUmoVcX3SrQpWgpbyvpq/vmVwD+3t7aGRKvFWSWE2kU63X6obeXnfOg==',
        'sec-ch-ua-mobile': '?0',
        'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.131 Safari/537.36',
        'sec-fetch-site': 'same-origin',
        'sec-fetch-mode': 'cors',
        'sec-fetch-dest': 'empty',
        'referer': 'https://www.truecar.com/used-cars-for-sale/listings/location-san-francisco-ca/',
        'accept-language': 'en-US,en;q=0.9,de-DE;q=0.8,de;q=0.7',
        'cookie': 'tc_v=732d8f6c-016d-4e04-99ea-962821b285bd; u=rBEABWDn9kVuLQARuYhKAg==; user_zip_code_san-francisco-ca=94102; user_zip_code_new-york-ny=10001; _abp_auth_p=eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIwN2Q0MTBkOS0zYjYwLTQwNTAtYjhiMy0yN2VhNzI5YjI4MmEiLCJpYXQiOjE2MjgwNTk1ODAsImV4cCI6MTY0NDA1OTU4MCwianRpIjoiMTkxNjdlZmYtNDg5NC00NWE5LTgwMzItYjNjNWYyNjJhZjg3IiwiYXV0aGVudGljYXRlZCI6ZmFsc2UsInByZXNldCI6eyJhZmZpbGlhdGlvbnMiOltdfSwiYXVkIjoiaHR0cHM6Ly93d3cudHJ1ZWNhci5jb20ifQ; _abp_auth_s=aLdzR1stp7FxiV6Cbnggg8fmtny6X9FAap2fnCqWeXg; referrer=ZTC0000000; g_state=^{^\\^i_p^\\^:1628151776913,^\\^i_l^\\^:2^}; capselaPreferredPostalCode=94102; XSRF-TOKEN=sRHovNRE9jEGmReSnaj0SFGY^%^2FL5^%^2ByUbMUmoVcX3SrQpWgpbyvpq^%^2FvmVwD^%^2B3t7aGRKvFWSWE2kU63X6obeXnfOg^%^3D^%^3D; _abp_backend_session=a3VMTkJGelNWbmptb3Q4aHlObjNIT1VXNFBZNXREeEg0SHo4MEZGdTNoalFRSzV2VldsaStYa3J6UDZSdGJvZDJsRUtXUkJVZ0ZycXhrbU5PZ0gxZms3RGFtRFJVbXZTeTFzeGI3WGo2VGVxUmptdm1OYVdmZGVrWlFvMDIxQVdLZ1BnM1A2SGZBa1pKbXhERlZOVzlRPT0tLW9ONTI2Y0xLM0lLY1g1NE5qSEpaSVE9PQ^%^3D^%^3D--4c4bf94f0b241212f5e3b798c48f4a5f0e366f7f; _dd_s=rum=0&expire=1628089775124',
        'if-none-match': 'W/^\\^a5ee0fa2b55644cda4fcbfe817357d97^\\^',
    }

    params = (
        ('city', 'san-francisco'),
        ('collapse', 'true'),
        ('fallback', 'true'),
        ('include_incentives', 'true'),
        ('include_targeted_incentives', 'true'),
        ('new_or_used', 'u'),
        ('page', str(i)),
        ('per_page', '30'),
        ('postal_code', '94102'),
        ('search_event', 'true'),
        ('sort^/[^/]', 'best_match'),
        ('sponsored', 'true'),
        ('state', 'ca'),
    )

    # response
    response = requests.get('https://www.truecar.com/abp/api/vehicles/used/listings', headers=headers, params=params)

    # json object
    results_json = response.json()
    
    # result items (30 items per page)
    result_items = results_json['listings']
    
    for result in result_items:
    
        # brand
        brand_sf.append(result['vehicle']['make'])

        # model
        model_sf.append(result['vehicle']['model'])

        # mileage
        mileage_sf.append(result['vehicle']['mileage'])

        # year
        year_sf.append(result['vehicle']['year'])

        # price
        price_sf.append(result['pricing']['list_price'])

In [6]:
df_sf_single = pd.DataFrame({'Brand': brand_sf, 'Model': model_sf, 'Mileage': mileage_sf, 'Year': year_sf,
                             'Price':price_sf})

In [7]:
df_sf_single

           Brand        Model  Mileage  Year    Price
0            BMW     3 Series    68250  2011   8500.0
1          smart       fortwo    70320  2016   7950.0
2            BMW           M3    26300  2018  64109.0
3            BMW           X1    15476  2018  26995.0
4            BMW     4 Series    19038  2018  29995.0
...          ...          ...      ...   ...      ...
5065    Chrysler          200    22889  2016  16499.0
5066       Lexus           GX    31733  2017  39990.0
5067  Land Rover  Range Rover    73455  2016  46488.0
5068         Kia      Sorento    70395  2018  19990.0
5069        Audi           S5    40649  2012  26339.0

[5070 rows x 5 columns]

# Part 3 - Combine Data & Connect to Database - PostgreSQL

In [8]:
# merge dataframes
merged_dataframes = pd.concat([df_ny_single, df_sf_single], ignore_index=True)

In [9]:
merged_dataframes

               Brand        Model  Mileage  Year    Price
0      Mercedes-Benz      C-Class    29641  2018  29901.0
1              Lexus           RX    39908  2017  30171.0
2      Mercedes-Benz      C-Class    13015  2018  31902.0
3              Lexus           ES    29288  2018  28224.0
4      Mercedes-Benz      C-Class     9469  2018  32901.0
...              ...          ...      ...   ...      ...
10135       Chrysler          200    22889  2016  16499.0
10136          Lexus           GX    31733  2017  39990.0
10137     Land Rover  Range Rover    73455  2016  46488.0
10138            Kia      Sorento    70395  2018  19990.0
10139           Audi           S5    40649  2012  26339.0

[10140 rows x 5 columns]

In [10]:
merged_dataframes['Price'] = merged_dataframes['Price'].astype('Int64')

In [11]:
# output updated dataframe
merged_dataframes

               Brand        Model  Mileage  Year  Price
0      Mercedes-Benz      C-Class    29641  2018  29901
1              Lexus           RX    39908  2017  30171
2      Mercedes-Benz      C-Class    13015  2018  31902
3              Lexus           ES    29288  2018  28224
4      Mercedes-Benz      C-Class     9469  2018  32901
...              ...          ...      ...   ...    ...
10135       Chrysler          200    22889  2016  16499
10136          Lexus           GX    31733  2017  39990
10137     Land Rover  Range Rover    73455  2016  46488
10138            Kia      Sorento    70395  2018  19990
10139           Audi           S5    40649  2012  26339

[10140 rows x 5 columns]

#### Excel File

In [84]:
merged_dataframes.to_excel('merged_dataframes.xlsx', index=False)

#### Connect to PostgreSQL

In [ ]:
# create sqlalchemy engine
engine = create_engine('postgres://postgres:12345@localhost:5432')
merged_dataframes.to_sql('merged_dataframes', engine)